#!/usr/bin/python3
#coding:utf-8
#2021-09-29

########################################037.1_集合元素的判断########################################
set_1 = {1, 2, 3, 4, 5, 6, 7}
print(10 in set_1)
print(100 in set_1)
print(10 not in set_1)
print(100 not in set_1)

########################################037.2_集合元素的添加########################################
#add()：添加一个元素
#update()：添加一个集合或多个元素
set_1.add(100)
print(set_1)

set_1.update({200, 300, 400})
print(set_1)

set_1.update([500, 600, 700])
print(set_1)

set_1.update((800, 900, 1000))
print(set_1)

########################################037.3_集合元素的删除########################################
#remove()：删除一个元素，若不存在报错
#discard()：删除一个元素，若不存在不报错
#pop()：随机删除一个元素
#clear()：清空集合元素
set_1.remove(1000)
print(set_1)

set_1.discard(1000)
print(set_1)

set_1.pop()
print(set_1)

set_1.clear()
print(set_1)










































