#!/usr/bin/python3
#coding:utf-8
#2021-10-04

########################################046_函数的参数传递########################################
#参数传递有两种方式：
#位置传递：根据形式参数和实际参数对应位置一一进行参数传递
#关键字传递：根据形式参数和实际参数的名称进行参数传递
def calc1 (a, b) : #a、b称为形式参数
    c = a + b
    return c

print(calc1(10, 20)) #10、20称为实际参数


def calc2 (a, b) : #a、b称为形式参数
    c = a / b
    return c

print(calc2(b = 10, a = 20)) #10、20称为实际参数














































































































