#!/usr/bin/python3
#coding:utf-8
#2021-09-16

########################################09_算术运算符########################################
#常用运算符包括：算术运算符、赋值运算符、比较运算符、布尔运算符、位运算符
#算术运算符包括：标准算术运算符、取余（模）运算符、幂运算符
#标准算术运算符包括：加（+）、减（-）、乘（*）、除（/）
#整除运算符（//）：一正一负向下取整，原则上使商小
#取余（模）运算符（%）：一正一负要公式、余数=被除数-除数*商（注意是整除向下取整的商）
#幂运算符（**）：次方运算

print("1 + 2 =", 1 + 2)
print("1 - 2 =", 1 - 2)
print("1 * 2 =", 1 * 2)
print("11 / 2 =", 11 / 2)
print("11 // 2 =", 11 // 2)
print("11 % 2 =", 11 % 2)
print("11 ** 2 =", 11 ** 2)

#正/正整除和取余操作
print("7 // 3 =", 7 // 3)
print("7 % 3 =", 7 % 3)

#负/负整除和取余操作
print("-7 // -3 =", -7 // -3)
print("-7 % -3 =", -7 % -3)

#0/正整除和取余操作
print("0 // 3 =", 0 // 3)
print("0 % 3 =", 0 % 3)

#0/负整除和取余操作
print("0 // -3 =", 0 // -3)
print("0 % -3 =", 0 % -3)

#正/负整除和取余操作
print("7 // -3 =", 7 // -3)
print("7 % -3 =", 7 % -3)

#负/正整除和取余操作
print("-7 // 3 =", -7 // 3)
print("-7 % 3 =", -7 % 3)

















